//цифровое устройство камень ножницы бумага

module lab
(
input [1:0]pl1, //левая часть
input [1:0]pl2, //правая
output [7:0] LEDG
);

//ничья - всё горит
//pl1 победил - левая горит
//pl2 победил - правая горит

// 00 = ничего 
// 01 = камень
// 10 = ножницы
// 11 = бумага

//левая часть
assign LEDG[7:4] = {4{(pl1[1] || pl1[0] || pl2[1] || ~pl2[0])
						 && (pl1[1] || pl1[0] || ~pl2[1] || pl2[0])
						 && (pl1[1] || pl1[0] || ~pl2[1] || ~pl2[0])
						 && (pl1[1] || ~pl1[0] || ~pl2[1] || ~pl2[0])
						 && (~pl1[1] || pl1[0] || pl2[1] || ~pl2[0])
						 && (~pl1[1] || ~pl1[0] || ~pl2[1] || pl2[0])}};

//правая часть
assign LEDG[3:0] = {4{(pl1[1] || ~pl1[0] || pl2[1] || pl2[0])
                   && (pl1[1] || ~pl1[0] || ~pl2[1] || pl2[0])
						 && (~pl1[1] || pl1[0] || pl2[1] || pl2[0])
						 && (~pl1[1] || pl1[0] || ~pl2[1] || ~pl2[0])
						 && (~pl1[1] || ~pl1[0] || pl2[1] || pl2[0])
						 && (~pl1[1] || ~pl1[0] || pl2[1] || ~pl2[0])}};

endmodule 